Revit 2027 API
Application.NewUV(UV) Method
Creates a UV object by copying the supplied UV object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV NewUV(
	UV uv
)
Public Function NewUV (
	uv As UV
) As UV
public:
UV^ NewUV(
	UV^ uv
)
member NewUV :
        uv : UV -> UV
Parameters
uv UV
The supplied UV object
Return Value
UV
See Also
Reference
Application Class
NewUV Overload
Autodesk.Revit.Creation Namespace